#include<stdio.h>
int main() {
	int a, b, a1, a2, a3, a4, b1, b2, b3;
	printf("1. 3자리의 숫자 두 개를 입력하시오.\n");
	scanf_s("%d %d", &a, &b);

	b3 = b / 100;
	b2 = b / 10 - 10 * b3;
	b1 = b - 100 * b3 - 10 * b2;

	a1 = a * b1;
	a2 = a * b2;
	a3 = a * b3;
	a4 = a * b;

	printf("%d %d %d %d\n\n", a1, a2, a3, a4);

	int c, c0, c1, c2, c3, c4, c5, c6;
	int d1, d2, d3;
	scanf_s("%d", &c1);
	c = (c1-1) / 3;
	c0 = 15 - c1 - 8 - (1 - c) * 4;
	d1 = c0 / 2;
	d2 = c0 % 2;
	d3 = 1-c;
	c2 = d1*4 + d2*2 + d3;

	c = (c2 - 1) / 3;
	c0 = 15 - c2 - 8 - (1 - c) * 4;
	d1 = c0 / 2;
	d2 = c0 % 2;
	d3 = 1-c;
	c3 = d1*4 + d2*2 + d3;
	//   5    4    6    2    3    1
	//1111 1111 1111 1111 1111 1111
	// 101  100  110  010  011  001
	//1010 1011 1001 1101 1100 1110

	// 101  100  110  010  011 001
	//101100110010011001

	c4 = 7 - c1;
	c5 = 7 - c2;
	c6 = 7 - c3;
	printf("%d %d %d %d %d %d", c1, c2, c3, c4, c5, c6);

	return 0;
}