#include<stdio.h>
int main()
{
	//1번 문제
	int num1, num2; //변수 선언할 때 콤마로 여러 개 선언 가능

	printf("두 개의 수를 입력하세요.\n");
	scanf_s("%d %d", &num1, &num2);

	printf("%d\n", num1 * (num2 % 10));//472x5
	printf("%d\n", num1 * ((num2 / 10) % 10));   //472x8
	printf("%d\n", num1 * (num2 / 100));//472x3
	printf("%d\n", num1 * num2);//472x385

	//2
	//"5 4 6 2 3 1"
	//5 4 6 2 3 1 5 4 6 2 3 1 5 ...
	//입력과 출력 예시
	//입력 : 4
	//출력[4 6 2 3 1 5]
	//
	//입력 : 5
	//출력[5 4 6 2 3 1]

	//네번째 숫자 = 7-첫번째숫자
	//두번째 숫자 = (7+네번째숫자-첫번째숫자)%7
	//다섯번째 숫자 = 7-두번째숫자
	//세번째숫자 = (7+다섯번째숫자-두번째숫자)%7
	//여섯번째숫자 = 7-세번째숫자

	int n1, n2, n3, n4, n5, n6;
	scanf_s("%d", &n1);
	n4 = 7 - n1;
	n2 = (7 + n4 - n1) % 7;
	n5 = 7 - n2;
	n3 = (7 + n5 - n2) % 7;
	n6 = 7 - n3;
	printf("%d %d %d %d %d %d\n", n1, n2, n3, n4, n5, n6);


	return 0;
}